Revit 2023 API
EdgeEndPoint Members
The EdgeEndPoint type exposes the following members.
Constructors
Name | Description
EdgeEndPoint(EdgeEndPoint)
 Creates a copy of the given EdgeEndPoint instance.
EdgeEndPoint(Edge, Int32)
 Constructs an instance of EdgeEndPoint.
Methods
Name | Description
Dispose
Releases all resources used by the EdgeEndPoint
Equals(Object)
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
Equals(EdgeEndPoint)
 Determines whether this EdgeEndPoint is equal to another.
Evaluate
 Evaluate the end point of the edge in 3d coordinates.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
Edge
 The Edge.
Index
 The index of the start or the end point of an Edge: 0 is the start point, 1 is the end point.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
EdgeEndPoint Class
Autodesk.Revit.DB Namespace